performance/load-testing/artillery-config.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"

  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery Load Test'
  
  # Performance thresholds
  ensure:
    - http.response_time.p95: 2000  # 95th percentile response time < 2s
    - http.response_time.p99: 5000  # 99th percentile response time < 5s
    - http.response_time.median: 500  # Median response time < 500ms
    - http.codes.200: 95  # 95% of requests should return 200
    - http.codes.4xx: 5   # Less than 5% 4xx errors
    - http.codes.5xx: 1   # Less than 1% 5xx errors

  # Plugins for enhanced reporting
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
    publish-metrics:
      - type: cloudwatch
        region: us-east-1
        namespace: StartupCompass/LoadTest
    expect:
      outputFormat: json
      reportFailuresAsErrors: true

  # Variables for dynamic testing
  variables:
    testUsers:
      - "user1@example.com"
      - "user2@example.com"
      - "user3@example.com"
      - "user4@example.com"
      - "user5@example.com"
    
    industries:
      - "Technology"
      - "Healthcare"
      - "Finance"
      - "Education"
      - "E-commerce"
    
    jobTypes:
      - "full-time"
      - "part-time"
      - "contract"
      - "internship"

scenarios:
  # User authentication flow
  - name: "User Authentication"
    weight: 20
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "{{ $randomString() }}@example.com"
            password: "TestPassword123!"
          capture:
            - json: "$.data.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]
      
      - get:
          url: "/users/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          ifTrue: "authToken"
          expect:
            - statusCode: [200, 401]

  # Browse startups
  - name: "Browse Startups"
    weight: 30
    flow:
      - get:
          url: "/startups"
          qs:
            page: "{{ $randomInt(1, 10) }}"
            limit: "{{ $randomInt(5, 20) }}"
            industry: "{{ $pick(industries) }}"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/startups/{{ $randomInt(1, 100) }}"
          expect:
            - statusCode: [200, 404]

  # Job search and application
  - name: "Job Search"
    weight: 25
    flow:
      - get:
          url: "/jobs"
          qs:
            page: "{{ $randomInt(1, 5) }}"
            limit: "{{ $randomInt(10, 50) }}"
            type: "{{ $pick(jobTypes) }}"
            location: "Remote"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/jobs/{{ $randomInt(1, 50) }}"
          expect:
            - statusCode: [200, 404]

  # Funding data browsing
  - name: "Funding Data"
    weight: 15
    flow:
      - get:
          url: "/funding"
          qs:
            page: "{{ $randomInt(1, 3) }}"
            limit: "{{ $randomInt(10, 30) }}"
            round: "Series A"
          expect:
            - statusCode: 200
            - hasProperty: "data"
      
      - get:
          url: "/funding/{{ $randomInt(1, 30) }}"
          expect:
            - statusCode: [200, 404]

  # Health checks and monitoring
  - name: "Health Checks"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"
      
      - get:
          url: "/health/ready"
          expect:
            - statusCode: 200
      
      - get:
          url: "/health/live"
          expect:
            - statusCode: 200

  # Heavy operations (create/update)
  - name: "Heavy Operations"
    weight: 5
    flow:
      # Register user
      - post:
          url: "/auth/register"
          json:
            email: "loadtest{{ $randomString() }}@example.com"
            password: "TestPassword123!"
            firstName: "Load"
            lastName: "Test"
          capture:
            - json: "$.data.token"
              as: "authToken"
          expect:
            - statusCode: [201, 409]
      
      # Create startup (if registration successful)
      - post:
          url: "/startups"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "LoadTest Startup {{ $randomString() }}"
            description: "A startup created during load testing"
            industry: "{{ $pick(industries) }}"
            stage: "seed"
            location: "San Francisco, CA"
          ifTrue: "authToken"
          expect:
            - statusCode: [201, 401, 400]
      
      # Post a job
      - post:
          url: "/jobs"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "LoadTest Job {{ $randomString() }}"
            description: "A job posted during load testing"
            company: "LoadTest Company"
            location: "Remote"
            type: "{{ $pick(jobTypes) }}"
            salary:
              min: 80000
              max: 120000
          ifTrue: "authToken"
          expect:
            - statusCode: [201, 401, 400]

# Custom functions for data generation
functions:
  generateRandomUser: |
    function(context, events, done) {
      context.vars.randomUser = {
        email: `loadtest${Math.random().toString(36).substr(2, 9)}@example.com`,
        firstName: `User${Math.floor(Math.random() * 1000)}`,
        lastName: `Test${Math.floor(Math.random() * 1000)}`
      };
      return done();
    }
  
  generateRandomStartup: |
    function(context, events, done) {
      const industries = ['Technology', 'Healthcare', 'Finance', 'Education'];
      const stages = ['idea', 'seed', 'series-a', 'series-b', 'growth'];
      
      context.vars.randomStartup = {
        name: `Startup${Math.random().toString(36).substr(2, 9)}`,
        industry: industries[Math.floor(Math.random() * industries.length)],
        stage: stages[Math.floor(Math.random() * stages.length)]
      };
      return done();
    }

# Before and after hooks
before:
  flow:
    - log: "Starting load test for StartupCompass Platform"
    - think: 1

after:
  flow:
    - log: "Load test completed"